petermm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
cleanup_write:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    //
    // return result
    //

    return OK_ATOM;
}

//
// i2c:read_bytes_nif/2
//

static term nif_i2c_read_bytes(Context *ctx, int argc, term argv[])
{
    TRACE("nif_read_bytes\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there is not a currently running transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_read_bytes: Another process is already transmitting");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // extract the arguments
    //
    term req = argv[1];
    if (UNLIKELY(!term_is_tuple(req))) {
        ESP_LOGE(TAG, "nif_read_bytes: Request is not a tuple");
        RAISE_ERROR(BADARG_ATOM);
    }
    int arity = term_get_tuple_arity(req);
    if (UNLIKELY(arity < 2 || arity > 3)) {
        ESP_LOGE(TAG, "nif_read_bytes: Request tuple has invalid arity");
        RAISE_ERROR(BADARG_ATOM);
    }

    term address = term_get_tuple_element(req, 0);
    if (UNLIKELY(!term_is_i2c_address(address))) {
        ESP_LOGE(TAG, "nif_read_bytes: Address is not a valid 7-bit I2C address");
        RAISE_ERROR(BADARG_ATOM);
    }
    uint8_t addr = term_to_uint8(address);

    term read_bytes = term_get_tuple_element(req, 1);
    if (UNLIKELY(!term_is_non_neg_int(read_bytes))) {
        ESP_LOGE(TAG, "nif_read_bytes: Count is not a non-negative integer");
        RAISE_ERROR(BADARG_ATOM);
    }
    avm_int_t read_count = term_to_int32(read_bytes);

    term register_ = term_invalid_term();
    uint8_t register_address = 0;
    if (arity == 3) {
        register_ = term_get_tuple_element(req, 2);
        if (UNLIKELY(!term_is_uint8(register_))) {
            ESP_LOGE(TAG, "nif_read_bytes: Register is not a byte");
            RAISE_ERROR(BADARG_ATOM);
        }
        register_address = term_to_uint8(register_);
    }

    //
    // initialize the output buffer
    //

    // {ok, Data :: binary()}
    if (UNLIKELY(memory_ensure_free_opt(ctx, TUPLE_SIZE(2) + term_binary_heap_size(read_count), MEMORY_NO_GC) != MEMORY_GC_OK)) {
        ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        return OUT_OF_MEMORY_ATOM;
    }
    term data = term_create_uninitialized_binary(read_count, &ctx->heap, ctx->global);
    uint8_t *buf = (uint8_t *) term_binary_data(data);

    //
    // Enqueue and run the I2C commands
    //

    esp_err_t err;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    err = i2c_master_start(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue start bit: err: %i.", err);
        goto cleanup_read;
    }

    if (!term_is_invalid_term(register_)) {
        err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue write address: err: %i.", err);
            goto cleanup_read;
        }
        err = i2c_master_write_byte(cmd, register_address, ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue register address: err: %i.", err);
            goto cleanup_read;
        }
        err = i2c_master_start(cmd);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue repeated start: err: %i.", err);
            goto cleanup_read;
        }
    }

    err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_READ, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue I2C bus address: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_read(cmd, buf, read_count, I2C_MASTER_LAST_NACK);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue read data: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_stop(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue stop bit: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_cmd_begin(rsrc_obj->i2c_num, cmd, MS_TO_TICKS(rsrc_obj->send_timeout_ms));

cleanup_read:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    //
    // return result
    //

    // NB. memory has already been allocated above for {ok, Data} tuple
    return create_pair(ctx, OK_ATOM, data);
}

//
// i2c:begin_transmission_nif/1
//

static term nif_i2c_begin_transmission(Context *ctx, int argc, term argv[])
{
    TRACE("nif_begin_transmission\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there is not a currently running transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_begin_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // extract the arguments
    //

    term address = argv[1];
    if (UNLIKELY(!term_is_i2c_address(address))) {
        ESP_LOGE(TAG, "nif_begin_transmission: Address is not a valid 7-bit I2C address");
        RAISE_ERROR(BADARG_ATOM);
    }
    uint8_t addr = term_to_uint8(address);

    //
    // Initiate the I2C command
    //

    esp_err_t err;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    err = i2c_master_start(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_begin_transmission; enqueue start bit: err: %i.", err);
        goto cleanup_begin;
    }

