petermm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
    err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_begin_transmission; enqueue I2C bus address: err: %i.", err);
        goto cleanup_begin;
    }

    rsrc_obj->transmitting_pid = term_from_local_process_id(ctx->process_id);
    rsrc_obj->cmd = cmd;

    return OK_ATOM;

cleanup_begin:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        return OUT_OF_MEMORY_ATOM;
    }
    return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
}

//
// i2c:enqueue_write_bytes_nif/1
//

static term nif_i2c_enqueue_write_bytes(Context *ctx, int argc, term argv[])
{
    TRACE("nif_enqueue_write_bytes\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there the currently running transmission is the current process
    //
    term pid = term_from_local_process_id(ctx->process_id);
    if (UNLIKELY(rsrc_obj->transmitting_pid != pid)) {
        ESP_LOGE(TAG, "nif_end_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    term data = argv[1];
    if (UNLIKELY(!term_is_binary(data))) {
        ESP_LOGE(TAG, "nif_enqueue_write_bytes: Data is not a binary");
        RAISE_ERROR(BADARG_ATOM);
    }
    const uint8_t *buf = (const uint8_t *) term_binary_data(data);
    size_t len = term_binary_size(data);

    esp_err_t err;
    for (size_t i = 0; i < len; ++i) {
        err = i2c_master_write_byte(rsrc_obj->cmd, buf[i], ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_enqueue_write_bytes; enqueue i2c_master_write_byte: err: %i.", err);
            reset_i2c_transmission_state(rsrc_obj);
            if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
                return OUT_OF_MEMORY_ATOM;
            }
            return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
        }
    }

    return OK_ATOM;
}

//
// i2c:end_transmission_nif/1
//

static term nif_i2c_end_transmission(Context *ctx, int argc, term argv[])
{
    TRACE("nif_end_transmission\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there the currently running transmission is the current process
    //
    term pid = term_from_local_process_id(ctx->process_id);
    if (UNLIKELY(rsrc_obj->transmitting_pid != pid)) {
        ESP_LOGE(TAG, "nif_end_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // Write the stop bit and flush the I2C command(s) that have been written
    //

    esp_err_t err;
    err = i2c_master_stop(rsrc_obj->cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_end_transmission; enqueue stop bit: err: %i.", err);
        goto cleanup_end;
    }

    err = i2c_master_cmd_begin(rsrc_obj->i2c_num, rsrc_obj->cmd, MS_TO_TICKS(rsrc_obj->send_timeout_ms));

cleanup_end:
    i2c_cmd_link_delete(rsrc_obj->cmd);
    rsrc_obj->cmd = NULL;
    rsrc_obj->transmitting_pid = term_invalid_term();
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    return OK_ATOM;
}

//
// entrypoints
//

static void i2c_resource_dtor(ErlNifEnv *caller_env, void *obj)
{
    UNUSED(caller_env);
    struct I2CResource *rsrc_obj = (struct I2CResource *) obj;

    esp_err_t err = close_i2c_resource(rsrc_obj);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGW(TAG, "Failed to delete driver in resource d'tor.  err=%i", err);
    }
}

static const ErlNifResourceTypeInit I2CResourceTypeInit = {
    .members = 1,
    .dtor = i2c_resource_dtor,
};

static const struct Nif i2c_open_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_open
};
static const struct Nif i2c_close_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_close
};
static const struct Nif i2c_read_bytes_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_read_bytes
};
static const struct Nif i2c_write_bytes_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_write_bytes
};
static const struct Nif i2c_begin_transmission_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_begin_transmission
};
static const struct Nif i2c_enqueue_write_bytes_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_enqueue_write_bytes
};
