petermm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
static const struct Nif i2c_end_transmission_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_end_transmission
};

#ifdef CONFIG_AVM_ENABLE_I2C_RESOURCE_NIFS

void i2c_resource_init(GlobalContext *global)
{
    ErlNifEnv env;
    erl_nif_env_partial_init_from_globalcontext(&env, global);
    i2c_resource_type = enif_init_resource_type(&env, "i2c_resource", &I2CResourceTypeInit, ERL_NIF_RT_CREATE, NULL);
}

const struct Nif *i2c_resource_get_nif(const char *nifname)
{
    if (strcmp("i2c:open_nif/1", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_open_nif;
    }
    if (strcmp("i2c:close_nif/1", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_close_nif;
    }
    if (strcmp("i2c:read_bytes_nif/2", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_read_bytes_nif;
    }
    if (strcmp("i2c:write_bytes_nif/2", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_write_bytes_nif;
    }
    if (strcmp("i2c:begin_transmission_nif/2", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_begin_transmission_nif;
    }
    if (strcmp("i2c:enqueue_write_bytes_nif/2", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_enqueue_write_bytes_nif;
    }
    if (strcmp("i2c:end_transmission_nif/1", nifname) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_end_transmission_nif;
    }
    return NULL;
}

REGISTER_NIF_COLLECTION(i2c_resource, i2c_resource_init, NULL, i2c_resource_get_nif)

#endif
